app/Models/UsersModel.php

SELECT *
FROM `users`
WHERE `user` = 'matias'
AND `active` = 1
 LIMIT 1
---
    public function validateUser ($user, $password){
        $user = $this->where(['user' => $user, 'active' => 1])->first();